; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v11)
             (pred_10 ?v13 ?v6)
             (pred_7 ?v10 ?v6)
             (pred_5 ?v4 ?v10 )
	     (pred_4 ?v10)
             (pred_9 ?v12)
             (pred_6 ?v13)
             (pred_11 ?v6)
             (pred_3 ?v10)
             (pred_2 ?v13)
             (pred_12 ?v10)
             (pred_1 ))



(:action op_2
:parameters (?v3 ?v9 ?v8 ?v5)
:precondition (and (pred_9 ?v3) (pred_9 ?v9) (pred_6 ?v8) (pred_11 ?v5)
          (pred_8 ?v3 ?v9) (pred_10 ?v8 ?v5)
                   (pred_7 ?v9 ?v5) (pred_4 ?v3) 
                   (pred_3 ?v9) (pred_2 ?v8))
:effect (and  (pred_12 ?v9) (not (pred_3 ?v9))))


(:action op_4
:parameters (?v3 ?v1)
:precondition (and (pred_9 ?v3) (pred_9 ?v1)
               (pred_4 ?v3) (pred_8 ?v3 ?v1) (pred_12 ?v1))
:effect (and (pred_4 ?v1) (not (pred_4 ?v3))))

(:action op_5
:parameters (?v3 ?v8)
:precondition (and (pred_9 ?v3) (pred_6 ?v8) 
                  (pred_4 ?v3) (pred_5 ?v8 ?v3) (pred_1 ))
:effect (and (pred_2 ?v8)
   (not (pred_5 ?v8 ?v3)) (not (pred_1 ))))


(:action op_1
:parameters (?v3 ?v2 ?v7)
:precondition (and (pred_9 ?v3) (pred_6 ?v2) (pred_6 ?v7)
                  (pred_4 ?v3) (pred_2 ?v7) (pred_5 ?v2 ?v3))
:effect (and (pred_2 ?v2) (pred_5 ?v7 ?v3)
        (not (pred_2 ?v7)) (not (pred_5 ?v2 ?v3))))

(:action op_3
:parameters (?v3 ?v8)
:precondition (and (pred_9 ?v3) (pred_6 ?v8) 
                  (pred_4 ?v3) (pred_2 ?v8))
:effect (and (pred_1 ) (pred_5 ?v8 ?v3) (not (pred_2 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_19 obj_07 obj_10 obj_11 obj_17 obj_13 obj_08 obj_03 obj_06 obj_18 obj_16 obj_09 obj_20 obj_01 obj_02
    obj_15 obj_05
    obj_12 obj_04
    )

    (:init
       (pred_1)

       (pred_9 obj_14)
       (pred_9 obj_19)
       (pred_9 obj_07)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_9 obj_17)
       (pred_9 obj_13)
       (pred_9 obj_08)
       (pred_9 obj_03)
       (pred_9 obj_06)
       (pred_9 obj_18)
       (pred_9 obj_16)
       (pred_9 obj_09)
       (pred_9 obj_20)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_11 obj_15)
       (pred_11 obj_05)
       (pred_6 obj_12)
       (pred_6 obj_04)

       (pred_8 obj_14 obj_11)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_19 obj_07)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_07 obj_10)
       (pred_8 obj_07 obj_19)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_10 obj_07)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_14)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_13 obj_18)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_08 obj_16)
       (pred_8 obj_08 obj_10)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_03 obj_09)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_13)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_16 obj_02)
       (pred_8 obj_16 obj_08)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_20 obj_01)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_18)
       (pred_8 obj_01 obj_20)
       (pred_8 obj_02 obj_16)
       (pred_8 obj_02 obj_01)
       (pred_3 obj_17)
       (pred_3 obj_01)
       (pred_7  obj_17 obj_15)
       (pred_7  obj_01 obj_05)
       (pred_12 obj_14)
       (pred_12 obj_19)
       (pred_12 obj_07)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_08)
       (pred_12 obj_03)
       (pred_12 obj_06)
       (pred_12 obj_18)
       (pred_12 obj_16)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_02)

       (pred_10  obj_12 obj_15)
       (pred_10  obj_04 obj_05)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_04 obj_07)
       (pred_4 obj_13)
    )

    (:goal (and
       (pred_5 obj_12 obj_17)
    ))
(:constraints
  (always (not (pred_4 obj_08)))
)
)

; plan
1. (op_4 obj_13 obj_18)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_18)
   goals met: 0 of 1
2. (op_4 obj_18 obj_16)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_16)
   goals met: 0 of 1
3. (op_4 obj_16 obj_02)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_02)
   goals met: 0 of 1
4. (op_5 obj_02 obj_12)
   deleted: (pred_5 obj_12 obj_02) (pred_1)
   added: (pred_2 obj_12)
   goals met: 0 of 1
5. (op_4 obj_02 obj_16)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_16)
   goals met: 0 of 1
6. (op_4 obj_16 obj_18)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_18)
   goals met: 0 of 1
7. (op_4 obj_18 obj_13)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_13)
   goals met: 0 of 1
8. (op_2 obj_13 obj_17 obj_12 obj_15)
   deleted: (pred_3 obj_17)
   added: (pred_12 obj_17)
   goals met: 0 of 1
9. (op_4 obj_13 obj_17)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_17)
   goals met: 0 of 1
10. (op_3 obj_17 obj_12)
   deleted: (pred_2 obj_12)
   added: (pred_1) (pred_5 obj_12 obj_17)
   goals met: 1 of 1
